In [66]:
from setup_general import *

In [67]:
additional_name = pd.read_csv('data/typeless/additional_name.csv')
description = pd.read_csv('data/typeless/description.csv', sep=';')
dimensions = pd.read_csv('data/typeless/dimensions.csv')
events = pd.read_csv('data/typeless/events.csv')
general_info = pd.read_csv('data/typeless/general_info.csv', sep=';')
materials = pd.read_csv('data/typeless/materials.csv')
technique = pd.read_csv('data/typeless/technique.csv')

dfs = [additional_name, description, events, general_info]

all_types = pd.read_excel('data/typeless/all_types.xlsx')

In [68]:
from functools import reduce
df_merged = reduce(lambda  left,right: pd.merge(left,right,on=['MUSEAAL_ID'],
                                            how='outer'), dfs)

In [69]:
all_types.head()

     ID  KLASSIFIKAATOR_ID                     NIMETUS
0  4824              23499                         ???
1  4935              32081  FDC (esimese päeva ümbrik)
2  3071              16573                        ader
3  3562              17069                    aer/mõla
4  3932              17444                         ahi

In [70]:
train.head(1)

,full_nr,name,ks,material,commentary,event_type,location,start,end,before_Christ,country_and_unit,participants_role,participant,parish,text,class,technique,parameter,unit,value,museum_abbr,musealia_mark,musealia_seria_nr,musealia_queue_nr,musealia_additional_nr,collection_mark,collection_queue_nr,collection_additional_nr,element_count,legend,is_original,initial_info,damages,state,color,additional_text,type
id,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
2065396,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,AM,NaN,NaN,NaN,NaN,F,97.0,NaN,1.0,NaN,NaN,NaN,NaN,hea,NaN,NaN,foto

In [71]:
additional_name.head()

,MUSEAAL_ID,TAIS_NR,TEKST,LIIK
0,2226246,ÜAM _ 1146:44/b AjAM 1:41/b,Alus peeglile,endine nimetus
1,1107089,VK _ 4841:7 Ek 1:7,Munamägi,valmistaja nimetus
2,1414607,ETMM _ 12389:44 F 1:45,Foto Neeme Järvi,nimetus lähtedokumendil
3,1415323,ETMM _ 12389:80 F 1:72,Foto Kati Murutar,nimetus lähtedokumendil
4,1415334,ETMM _ 12389:91 F 1:134,Foto Allan Roosileht,nimetus lähtedokumendil

In [72]:
additional_name = additional_name.groupby('MUSEAAL_ID', as_index=True).agg({'TEKST':' '.join})

In [73]:
additional_name = additional_name.rename(columns={'TEKST':'text'})

In [74]:
description = description.groupby('MUSEAAL_ID', as_index=True).agg({'LISATEKST':' '.join})
description = description.rename(columns={'LISATEKST':'additional_text'})

In [75]:
# commentary super rare -> could be used finally, also in tech, mat
# get Name?
# rename params
dimensions.head(1)

,MUSEAAL_ID,TAIS_NR,NIMETUS,PARAMEETER,YHIK,VAARTUS,KOMMENTAAR
0,98554,KMM GE 20:296,Amor (Eros) ja Psyche,kõrgus,cm,4.5,NaN

In [76]:
dimensions = dimensions.rename(columns={'PARAMEETER':'parameter','TAIS_NR':'full_nr', 'NIMETUS':'name', 'YHIK':'unit','VAARTUS':'value'}).drop(columns=['KOMMENTAAR'])

In [77]:
events.head()

,MUSEAAL_ID,TAIS_NR,SYNDMUSE_LIIK,ASUKOHT,ALGUS,LOPP,ENNE_KR,KUU,RIIK_ADMIN_KOND,OSALEJA_ROLL,OSALEJA,KIHELKOND
0,109350,"KLM ET F22 1:4/1,2,3",KVIS sündmus puudub,NaN,NaN,NaN,NaN,NaN,,koguja,"Hennoste, Mihkel",NaN
1,245718,PM TALK 1,botaanika,NaN,1929,1931,NaN,NaN,Eesti,kasutaja/omanik,Türi apteek,NaN
2,1339439,TM _ 24:29 K 1:29,kutseharidus,NaN,1918,1944,ei,NaN,Eesti Tartumaa,NaN,NaN,NaN
3,1339438,TM _ 24:28 K 1:28,kutseharidus,NaN,1918,1944,ei,NaN,Eesti Tartumaa,NaN,NaN,NaN
4,1339437,TM _ 24:27 K 1:27,kutseharidus,NaN,1918,1944,ei,NaN,Eesti Tartumaa,NaN,NaN,NaN

In [78]:
events = events.groupby('MUSEAAL_ID', as_index=True).first()

In [79]:
events = events.rename(columns={'TAIS_NR':'full_nr', 'SYNDMUSE_LIIK':'event_type', 'ASUKOHT':'location', 'ALGUS':'start', 'LOPP':'end', 'ENNE_KR':'before_christ', 'RIIK_ADMIN_KOND':'country_and_unit', 'OSALEJA_ROLL':'participants_role', 'OSALEJA':'participant', 'KIHELKOND':'parish'}).drop(columns=['KUU'])

In [80]:
general_info = general_info.groupby('MUSEAAL_ID', as_index=True).first()

In [81]:
general_info = general_info.rename(columns={'ACR':'museum_abbr', 'TRT':'musealia_mark', 'TRS':'musealia_seria_nr', 'TRJ':'musealia_queue_nr', 'TRL':'musealia_additional_nr', 'KT':'collection_mark', 'KS':'ks', 'KJ':'collection_queue_nr','KL':'collection_additional_nr', 'NIMETUS':'name', 'KAHJUSTUSED':'damages', 'SEISUND':'state'}).drop(columns=['OLEMUS'])

In [82]:
materials = materials.rename(columns={'MATERJAL':'material', 'KOMMENTAAR':'commentary', 'TAIS_NR':'full_nr', 'NIMETUS':'name'})

In [83]:
materials['commentary'] = materials['commentary'].replace(np.nan,'')

In [84]:
materials = materials.groupby('MUSEAAL_ID', as_index=True).agg({'material':'>'.join, 'commentary':' '.join})

In [85]:
materials['commentary'] = materials['commentary'].replace('', np.nan)

In [86]:
technique = technique.rename(columns={'TEHNIKA':'technique','TAIS_NR':'full_nr', 'NIMETUS':'name'}).drop(columns=['KOMMENTAAR'])

In [87]:
technique = technique.groupby('MUSEAAL_ID', as_index=True).agg({'technique':'>'.join})